MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX675F256H.atdf
         <register caption="" name="LATD" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATD" />
            <bitfield mask="0x00000002" name="LATD" />
            <bitfield mask="0x00000004" name="LATD" />
            <bitfield mask="0x00000008" name="LATD" />
            <bitfield mask="0x00000010" name="LATD" />
            <bitfield mask="0x00000020" name="LATD" />
            <bitfield mask="0x00000040" name="LATD" />
            <bitfield mask="0x00000080" name="LATD" />
            <bitfield mask="0x00000100" name="LATD" />
            <bitfield mask="0x00000200" name="LATD" />
            <bitfield mask="0x00000400" name="LATD" />
            <bitfield mask="0x00000800" name="LATD" />
            <bitfield mask="0x00001000" name="LATD" />
            <bitfield mask="0x00002000" name="LATD" />
            <bitfield mask="0x00004000" name="LATD" />
            <bitfield mask="0x00008000" name="LATD" />
         </register>
         <register caption="" name="LATE" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATE" />
            <bitfield mask="0x00000002" name="LATE" />
            <bitfield mask="0x00000004" name="LATE" />
            <bitfield mask="0x00000008" name="LATE" />
            <bitfield mask="0x00000010" name="LATE" />
            <bitfield mask="0x00000020" name="LATE" />
            <bitfield mask="0x00000040" name="LATE" />
            <bitfield mask="0x00000080" name="LATE" />
            <bitfield mask="0x00000100" name="LATE" />
            <bitfield mask="0x00000200" name="LATE" />
            <bitfield mask="0x00000400" name="LATE" />
            <bitfield mask="0x00000800" name="LATE" />
            <bitfield mask="0x00001000" name="LATE" />
            <bitfield mask="0x00002000" name="LATE" />
            <bitfield mask="0x00004000" name="LATE" />
            <bitfield mask="0x00008000" name="LATE" />
         </register>
         <register caption="" name="LATF" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATF" />
            <bitfield mask="0x00000002" name="LATF" />
            <bitfield mask="0x00000004" name="LATF" />
            <bitfield mask="0x00000008" name="LATF" />
            <bitfield mask="0x00000010" name="LATF" />
            <bitfield mask="0x00000020" name="LATF" />
            <bitfield mask="0x00000040" name="LATF" />
            <bitfield mask="0x00000080" name="LATF" />
            <bitfield mask="0x00000100" name="LATF" />
            <bitfield mask="0x00000200" name="LATF" />
            <bitfield mask="0x00000400" name="LATF" />
            <bitfield mask="0x00000800" name="LATF" />
            <bitfield mask="0x00001000" name="LATF" />
            <bitfield mask="0x00002000" name="LATF" />
            <bitfield mask="0x00004000" name="LATF" />
            <bitfield mask="0x00008000" name="LATF" />
         </register>
         <register caption="" name="ODCB" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCB" />
            <bitfield mask="0x00000002" name="ODCB" />
            <bitfield mask="0x00000004" name="ODCB" />
            <bitfield mask="0x00000008" name="ODCB" />
            <bitfield mask="0x00000010" name="ODCB" />
            <bitfield mask="0x00000020" name="ODCB" />
            <bitfield mask="0x00000040" name="ODCB" />
            <bitfield mask="0x00000080" name="ODCB" />
            <bitfield mask="0x00000100" name="ODCB" />
            <bitfield mask="0x00000200" name="ODCB" />
            <bitfield mask="0x00000400" name="ODCB" />
            <bitfield mask="0x00000800" name="ODCB" />
            <bitfield mask="0x00001000" name="ODCB" />
            <bitfield mask="0x00002000" name="ODCB" />
            <bitfield mask="0x00004000" name="ODCB" />
            <bitfield mask="0x00008000" name="ODCB" />
         </register>
         <register caption="" name="ODCC" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCC" />
            <bitfield mask="0x00000002" name="ODCC" />
            <bitfield mask="0x00000004" name="ODCC" />
            <bitfield mask="0x00000008" name="ODCC" />
            <bitfield mask="0x00000010" name="ODCC" />
            <bitfield mask="0x00000020" name="ODCC" />
            <bitfield mask="0x00000040" name="ODCC" />
            <bitfield mask="0x00000080" name="ODCC" />
            <bitfield mask="0x00000100" name="ODCC" />
            <bitfield mask="0x00000200" name="ODCC" />
            <bitfield mask="0x00000400" name="ODCC" />
            <bitfield mask="0x00000800" name="ODCC" />
            <bitfield mask="0x00001000" name="ODCC" />
            <bitfield mask="0x00002000" name="ODCC" />
            <bitfield mask="0x00004000" name="ODCC" />
            <bitfield mask="0x00008000" name="ODCC" />
         </register>
         <register caption="" name="ODCD" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCD" />
            <bitfield mask="0x00000002" name="ODCD" />
            <bitfield mask="0x00000004" name="ODCD" />
            <bitfield mask="0x00000008" name="ODCD" />
            <bitfield mask="0x00000010" name="ODCD" />
            <bitfield mask="0x00000020" name="ODCD" />
            <bitfield mask="0x00000040" name="ODCD" />
            <bitfield mask="0x00000080" name="ODCD" />
            <bitfield mask="0x00000100" name="ODCD" />
            <bitfield mask="0x00000200" name="ODCD" />
            <bitfield mask="0x00000400" name="ODCD" />
            <bitfield mask="0x00000800" name="ODCD" />
            <bitfield mask="0x00001000" name="ODCD" />
            <bitfield mask="0x00002000" name="ODCD" />
            <bitfield mask="0x00004000" name="ODCD" />
            <bitfield mask="0x00008000" name="ODCD" />
         </register>
         <register caption="" name="ODCE" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCE" />
            <bitfield mask="0x00000002" name="ODCE" />
            <bitfield mask="0x00000004" name="ODCE" />
            <bitfield mask="0x00000008" name="ODCE" />
            <bitfield mask="0x00000010" name="ODCE" />
            <bitfield mask="0x00000020" name="ODCE" />
            <bitfield mask="0x00000040" name="ODCE" />
            <bitfield mask="0x00000080" name="ODCE" />
            <bitfield mask="0x00000100" name="ODCE" />
            <bitfield mask="0x00000200" name="ODCE" />
            <bitfield mask="0x00000400" name="ODCE" />
            <bitfield mask="0x00000800" name="ODCE" />
            <bitfield mask="0x00001000" name="ODCE" />
            <bitfield mask="0x00002000" name="ODCE" />
            <bitfield mask="0x00004000" name="ODCE" />
            <bitfield mask="0x00008000" name="ODCE" />
         </register>
         <register caption="" name="ODCF" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCF" />
            <bitfield mask="0x00000002" name="ODCF" />
            <bitfield mask="0x00000004" name="ODCF" />
            <bitfield mask="0x00000008" name="ODCF" />
            <bitfield mask="0x00000010" name="ODCF" />
            <bitfield mask="0x00000020" name="ODCF" />
            <bitfield mask="0x00000040" name="ODCF" />
            <bitfield mask="0x00000080" name="ODCF" />
            <bitfield mask="0x00000100" name="ODCF" />
            <bitfield mask="0x00000200" name="ODCF" />
            <bitfield mask="0x00000400" name="ODCF" />
            <bitfield mask="0x00000800" name="ODCF" />
            <bitfield mask="0x00001000" name="ODCF" />
            <bitfield mask="0x00002000" name="ODCF" />
            <bitfield mask="0x00004000" name="ODCF" />
            <bitfield mask="0x00008000" name="ODCF" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01342" name="RCON" version="3">
      <register-group name="RCON">
         <register caption="Reset Control Register" name="RCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR" />
            <bitfield caption="External Reset (MCLR) Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Voltage Regulator Standby Enable bit" mask="0x00000100" name="VREGS" values="RCON__VREGS" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR" />
         </register>
         <register caption="Software Reset Register" name="RSWRST" offset="0x10" rw="RW" size="4">
            <bitfield caption="Software Reset Trigger bit" mask="0x00000001" name="SWRST" values="RSWRST__SWRST" />
         </register>
      </register-group>
